1s/ERP/Conf/Documents/Лико_ЗаявкаНаГравировкуВалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ЗаявкаНаГравировкуВалов</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказКлиента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Лико_ЗаявкиНаГравировкуВалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ВидыОперацийЗаявокНаГравировку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Валы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Форма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Формы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/AccumulationRegisters/Лико_ЗаявкиНаГравировкуВалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Лико_ЗаявкиНаГравировкуВалов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Вал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Форма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Формы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ЗаявкаНаГравировкуВалов/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		// Заполнение шапки
		ЗаказКлиента = ДанныеЗаполнения.Ссылка;
		Ответственный = Пользователи.ТекущийПользователь();
		Организация = ДанныеЗаполнения.Площадка.Организация;
		Площадка = ДанныеЗаполнения.Площадка;
		Для Каждого ТекСтрокаЦвета Из ДанныеЗаполнения.Цвета Цикл
			Если ТекСтрокаЦвета.Цветоделение И ТекСтрокаЦвета.ВидСекции.Родитель = Справочники.Лико_ВидыСекций.Глубокая Тогда
				НоваяСтрока = Валы.Добавить();
				НоваяСтрока.Вал = ТекСтрокаЦвета.Вал;
				НоваяСтрока.Форма = ТекСтрокаЦвета.Форма;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
					
	// регистр Лико_ЗаявкиНаГравировкуВалов Приход
	Движения.Лико_ЗаявкиНаГравировкуВалов.Записывать = Истина;
	Для Каждого ТекСтрокаВалы Из Валы Цикл
		Движение = Движения.Лико_ЗаявкиНаГравировкуВалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Вал = ТекСтрокаВалы.Вал;
		Движение.Форма = ТекСтрокаВалы.Форма;
		Движение.Количество = 1;
	КонецЦикла;

КонецПроцедуры
